Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: Yuck, that smells like shit!
jbo: .a'u nai ta panci simsa lo kalci

source: Okay, that will do.
jbo: .i'a ta banzu

source: No, that still doesn't satisfy me.
jbo: .i'a nai ta mi za'o na mansa

source: Very good! You did an excellent job.
jbo: .i'e do xamgu mutce gunka

source: Speaking objectively, math can be confusing for 1st graders.
jbo: .i'e cu'i lo cmaci ka'e cfipu lo co'a ve ckule

source: Hm, the picture is hanging crooked.
jbo: .i'e nai lo pixra ku korcu dandu

source: Yay! We're gonna win!
jbo: .i'i mi ba jinga

source: We demand a raise!
jbo: .i'i mi mi'ecpe lo se pleji nu zenba

source: Go away, I want to be alone!
jbo: .i'i nai ko cliva

source: Ah, you're a true friend.
jbo: .i'o do je'a pendo

source: Damn you, you always have good luck!
jbo: .i'o nai do ro roi se funca lo zabna

source: Yes, I lived there for many years.
jbo: .i'u mi ta xabju ze'a lo nanca be li so'i

source: I have no idea how much they are paying for that.
jbo: .i'u nai no da sidbo fi mi lo du'u pleji ma kau fo ta

source: Oh, no! The tiger is back!
jbo: ii lo tirxu cu xruti

source: Heh, the teacher won't find us here.
jbo: ii nai lo ctuca na ba tolcri mi'o ti

source: This way, Sir, if you please.
jbo: io ko mi jersi doi nolnau

source: Get your ass over here, you idiot!
jbo: io nai ko ti klama doi bebna

source: You're evil.
jbo: iu nai do palci

source: Look Mummy, I can read!
jbo: .o'a ju'i mamta mi kakne lo nu tcidu

source: Oh, *I* mopped only some part of the floor.
jbo: .o'a cu'i ba'e mi lumci pi su'o po'o lo loldi

source: Oops, I posted the message to the wrong newsgroup.
jbo: .o'a nai mi mrilu le notci lo srera noigri

source: I'll go with you to see the doctor.
jbo: .o'e mi do ba kansa lo nu vitke lo mikce

source: Clearly!
jbo: li'a

source: Careful! The floor is slippery.
jbo: .o'i lo loldi cu se sakli

source: Charge!
jbo: .o'i nai ko gunta

source: OK, try again.
jbo: .o'o ko za'u re'u troci

source: So, what drove you to do it?
jbo: .o'o cu'i ma pu mukti fi do

source: Damn, the elephants are blocking my way!
jbo: .o'o nai lo xanto cu fanta lo nu mi pagre

source: Ah, this is the life!
jbo: .o'u ti zabna se lifri

source: I followed the law.
jbo: .o'u cu'i mi pu tinbe lo selfla

source: Where is my son?
jbo: .o'u nai lo mi bersa cu zvati ma

source: Ouch! My eyes hurt.
jbo: .oi mi cortu lo kanla

source: Mmm, hot chocolate!
jbo: .oi nai glare cakla

source: Hah, that proves I was right!
jbo: .u'a la'e di'u je'urja'o lo du'u mi pu drani

source: Snif, Rover was a good dog.
jbo: .u'a nai la rover pu xamgu gerku

source: Wow, there are seven people here!
jbo: .u'e ze prenu cu zvati

source: Wow, that dog is really talented!
jbo: .u'e lo va gerku cu mutce stati

source: Pshaw, is that the best you can do?
jbo: .u'e nai xu ta xagrai lo se kakne be do

source: Heh, heh, he said "arsehole".
jbo: .u'i ta cusku zo ganxo

source: Yawn, that's enough for today.
jbo: .u'i nai banzu ca lo cabdei

source: I'm coming to your rescue!
jbo: .u'o mi do pu'o nurgau

source: Erm, may I stay here?
jbo: .u'o cu'i xu mi zifre lo nu stali

source: Oh no, I'm not going in there.
jbo: .u'o nai mi na nerkla ta

source: Sorry, I wasn't paying attention.
jbo: .u'u mi pu na jundi

source: Yeah, I just stepped on your foot. What are you going to do about it?
jbo: .u'u nai mi pu zi stapa lo do jamfu i do ba zukte ma

source: Ah, so *that*'s your sister.
jbo: ua ba'e ta do mensi

source: Huh? How is that relevant?
jbo: ua nai la'e di'u vajni fi ma

source: Oo, that's cold!
jbo: ue ta lenku

source: So what's new?
jbo: ue cu'i ma cnino

source: Everything was perfect, just as I expected.
jbo: ue nai ro da pu prane

source: Yay, I went to the store!
jbo: ui mi pu klama lo zarci

source: Sigh, this used to be a nice neighbourhood.
jbo: ui nai ti pu melbi jarbu

source: Pfew, that was a long sentence!
jbo: uo di'u clani jufra

source: Oh, you almost hit it.
jbo: uo nai do tu na ru'e darxi

source: Oh you poor thing! I'll get you a blanket.
jbo: uu mi ba dunda lo boxfo do

source: Mwa, ha, ha, ha, ha! Your soul will be mine!
jbo: uu nai mi ba ponse lo do pruxi

source: I expect that in the far future, you will know about every day.
jbo: ba'a do bazu djuno fi ro djedi

source: Oh yeah, I remember now.
jbo: .ua .i ba'anai

source: Are frogs reptiles? I don't expect them to be mammals.
jbo: .i y xu ro pipybanfi cu respa i pe'i na mabru

source: Me and Tal's recent discussion prompted me to ask you. I expect cats to taste better than dogs. Agree?
jbo: .i lonu mi joi la tal. puzi casnu ti cu mukti lonu mi te preti fo do .i pe'i loi mlatu loi gerku cu zmadu loka kukte .i xu tugni

source: Where near Austin do you live? Probably near UT.
jbo: ma se xabju do vi la Astn .i la'a vi la ubuty. cu xabju

source: You probably live in South Carolina.
jbo: la'a do xabju lo jecrsautkarolaina

source: In my experience, it is possible for me to speak quickly with pauses between every word.
jbo: ba'acu'i cumki fa lo nu mi sutra bacru ta'i tu'a lo nu lo denpa cu jbini ro valsi

source: Read it. I recall that you objected to the fact that the lojbanologists discussed in English.
jbo: ko tcidu .i ba'anai do pante vu'e lo za'i le banrglico cu bangu lo jboskepre

source: Everyone is silent.
jbo: roda smaji

source: Everybody loved Tom.
jbo: ro da pu prami la .tom.

source: Did someone die?
jbo: xu da co'a morsi

source: Somebody was in the house.
jbo: da pu nenri lo zdadi'u

source: I say my pipe is a non-pot pipe.
jbo: ca'e lo tubnu pe mi cu marna nai tubnu

source: The work is hereby done.
jbo: ca'e lo nu gunka ku mulno

source: I hereby pronounce that the two of you are mutual spouses.
jbo: ca'e lo re do cu simxu speni

source: I pronounce you husband and wife.
jbo: ca'e lo re do cu simxu speni

source: So, I dislike root beer.
jbo: ja'o mi tolnelci lo genja birje

source: Then you cannot be a cannibal.
jbo: ja'o do na prenu citka prenu

source: Then you must be Argentinian.
jbo: ja'o do gento

source: So you know only English and Lojban.
jbo: ja'o do se bangu lo glico je la lojban jenai lo drata

source: I can hear the loud sound of rain. So it must be raining heavily.
jbo: za'a cladu carvi .i ja'o carmi carvi

source: Of all good properties, God is the entity that has the most of it. Existence is a good property. Hence, God is the entity that is the most existent of all.
jbo: ro bu'a zo'u lo ka bu'a cu xamgu .inaja la cev cu traji lo ka bu'a .i lo ka zasti cu xamgu .i ja'o la cev cu traji lo ka zasti

source: Alcohol is the answer. I can't remember the question.
jbo: ju'a loi xalka cu danfu .i mi na morji lo preti

source: *Everything* should be doubted, I say.
jbo: ju'a ba'e ro da cu se senpi .ei

source: I'm tired and hungry. Tomorrow I mustn't eat or drink for religious reasons.
jbo: .i tatpi joi xagji .i ka'u ca lo cabdei mi na .ei citka je pinxe mu'i tu'a lo lijda

source: Almost all men hate something, but I am very good at being patient.
jbo: .i ka'u so'a nanmu cu xebni .iku'i mi certu lo ka .o'o zei cinmo

source: In my opinion, the fact that we can't easily send the zeroth one should be a reason for us not to try to send and sell the second one.
jbo: pe'i lo nu mi'ai na frili kakne lo nu benji la nomoi cu mukti .ei lo nu mi'ai na troci lo nu benji ja vecnu lo remoi

source: Presumably, none of the people are more than 25 years old.
jbo: ru'a no prenu cu nanca lo zmadu be li 25

source: I am slightly ill, I assume.
jbo: .i ru'a mi milxe lo ka bilma

source: I know internally that it stabbed my thumb. Something evil was coming close.
jbo: se'o tunta lo tamji pe ki .i da poi palci cu klama jibni

source: I was told that. E-mail, in particular.
jbo: mi pu te cusku lo nu go'i .i su'anai samselmri

source: They say that language is a virus from outer space.
jbo: ti'e lo bangu cu kensa vidru

source: I hear that the "rocks" on Titan are actually made of ice, not rock.
jbo: ti'e lo cmana pe la titan cu bisli jenai rokci

source: I see that you have a Greek name.
jbo: .i lo cmene be do cu za'a xelso

source: Apparently the present Taral is new.
jbo: .i za'a lo ca Taral cu cnino

source: The pile of garbage is as big as Mount Everest.
jbo: ba'u lo festi derxi cu simsa la tcomolunmas. lo ni barda

source: To be precise, I go, because I am forced to.
jbo: .i ba'ucu'i mi bai cliva

source: To put it mildly, the Moon is not small.
jbo: ba'u nai lo lunra cu na cmalu

source: Now, it so happens that I'm afraid of flying.
jbo: .i bi'u mi terpa lo nu klama fu lo vinji

source: As earlier mentioned, I was afraid.
jbo: .i bi'unai mi terpa

source: A boy saw a dog. And then this child got happy because of the dog.
jbo: lo nakla pu viska lo gerku i ce'o lo bi'unai verba pu co'a gleki gy

source: Broadly construed, it's, uh, slightly useful.
jbo: .i .y. do'a milxe ke pilno kakne

source: But most computer users know 'a little' English.
jbo: i ku'i so'e skami pilno cu milxe do'anai ke glico se bangu

source: I'm going to bed for real.
jbo: je'u ckana klama

source: Aha, Bancus, I thought that the boat for carrying you were in fact sail-powered.
jbo: .ue doi .bancus. mi pu krici lo nu do se bloti lo je'u te falnu

source: This so-called "evil" is something that is thought up by minds who do not understand the dark self.
jbo: lo je'unai palci cu xanri lo menli poi na jimpe lo manku sevzi

source: Again, hello.
jbo: coi ke'u

source: I told you, I disagree.
jbo: .ienai ke'u

source: Furthermore, in order to defeat Ganon, Link mends the eight scattered fragments of the triforce of wisdom, in order to have the magic triangle.
jbo: .i ke'u nai tezu'e lo nu jinga fi la Ganyn kei la Link cu cikre bi fatri spisa be lo cibmakfa pe lo ka prije tezu'e lo ka ponse lo makfa cibjgatai

source: My sister lives in Boston, hence, I'll likely visit the area.
jbo: .i lo mensi be mi ca xabju la boston ja'e lo nu la'a mi vitke fi lo se diklo

source: What's happening in Ukraine will probably result in peace, however.
jbo: la'a lo vukrygu'e tcini cu ba se jalge lo nu panpi ku'i

source: That's probably not so.
jbo: la'a na go'i

source: But it is unlikely that something is strange to everyone in every way.
jbo: i ku'i la'a nai su'o da cizra ro de ro di

source: Shane, who goes off and on attending the computer, is obviously crazy.
jbo: li'a la cein noi samjundi slilu cu jai fenki

source: Clearly, Lojban is easier than Postscript.
jbo: li'a la lojban cu zmadu la postskript lo ka frili

source: Of course, I haven't seen all marijuana users. But marijuana use causes temporary stupidity. Everyone knows that.
jbo: .i li'a mi na viska ro marna pilno .i ku'i lo zasni nu bebna cu se rinka lo nu pilno lo marna .i ro prenu cu djuno la'e di'u

source: Right, I see. But it's complicated.
jbo: li'anai go'i je'e

source: For instance, people who physically have to have alcohol can die from not drinking.
jbo: .i mu'a lo prenu poi xadni nitcu lo xalka cu kakne lo nu morsi ri'a lo nu na pinxe

source: A few people (I'm not telling who) have not cleaned up the room.
jbo: so'u prenu mu'a cu'i cu rivbi lo nu nicygau lo kumfa

source: I ate different fruits like apples and bananas and such. I also ate two potatoes.
jbo: mi pu citka lo vrici grute no'u mu'a lo plise je lo badna mu'a nai .i ji'a mi pu citka re patlu

source: My unbiased opinion is that the movie is awful.
jbo: pa'e lo skina cu mutce xlali

source: Of course I'm biased, but Lojban really is quite good.
jbo: pa'e nai la lojban. cu je'u xamgu

source: You are asking about something that is the reason for something happening in the future, and/or a usage. What is that reason, and is it for something happening in the future, a usage, or both?
jbo: pau do te preti lo se du'u ma krinu lo nu balvi kei ji lo nu pilno kei

source: But the sad things don't go away. They never do. Why is that so?
jbo: ku'i lo se badri cu na cliva mi'ai .i ze'e go'i .i ki'u ma pau

source: What are you talking about?!
jbo: .i do tavla fi ma pau nai

source: Above all, the translation exercises at the end of each chapter are.
jbo: .i go'i fa ra'u lo nunfanva cipra jufra pe lo fanmo be ro te ctuca pagbu

source: The lawgivers wanted women to work in traditionally male occupations. Equally importantly, the lawgivers wanted men to work in traditionally female occupations.
jbo: lo xe flalu cu te mukti lo nu lo ninmu cu se jibri lo se gunka poi pu steci lo nanmu .i ra'u cu'i lo xe flalu cu te mukti lo nu lo nanmu cu se jibri lo se gunka poi pu steci lo ninmu

source: Incidentally, I know that "rlpowell" is not a Lojban name.
jbo: ra'u nai mi djuno le du'u zoi u rlpowell u na cmevla

source: To be precise, I drank red wine.
jbo: sa'e mi pinxe lo xunre vanju

source: Okay. To be precise, it is understanding the flaws that I don't.
jbo: je'e .i mi na jimpe sa'e fi lo cfila

source: Roughly speaking, a doctor repairs people.
jbo: sa'e nai lo mikce cu cikre lo prenu

source: Simply put, a human being is an aggregate of many cells.
jbo: sa'u lo remna cu gunma so'i selci

source: Furthermore, each cell in the human body belongs to one out of many classes.
jbo: sa'u nai ro selci be lo remna cu cmima pa lo so'i klesi

source: By the way, are you called Robin as well?
jbo: ta'o xu do se cmene zo robin. ji'a

source: By the way, I am eating a bean stew right now.
jbo: ta'o mi caca'o citka lo stasu belo dembi

source: But back to the point; I now understand the word "material". I suggest using "vehicle door".
jbo: .i ta'onai mi ca jimpe tu'a zo marji .i .e'u pilno lu marce vorme li'u

source: In short, try Dict.
jbo: .i to'u ko ca troci tu'a la dikt

source: In detail, I'm considering the meaning of the command "exist somewhat".
jbo: .i to'unai mi pensi lo smuni be lu ko no'e zasti li'u

source: In other words, you agree with *me*?
jbo: va'i do tugni mi xu

source: To rephrase, why did you say an address?
jbo: .i va'i mu'i ma do cusku lo judri

source: You are feeling very tired. Yes, you are feeling very tired.
jbo: do co'a mutce tatpi .i va'i nai do co'a mutce tatpi

source: On the one hand, the place is cheap. On the other hand, it's too hot.
jbo: zu'u lo stuzi cu jai tolkargu .i zu'u nai ri glare dukse

source: On the other hand, my fingers usually get numb when I haven't slept well.
jbo: .i zu'u nai lo degji pi so'e roi te ganse jdika ri'a lo nu mi to'e xamgu sipna

source: I don't know what this is.
jbo: mi na djuno lo du'u ti mo kau

source: Please don't tell anyone where I am.
jbo: .e'o ko no da jungau lo du'u mi zvati ma kau

source: That's right, yes.
jbo: jo'a go'i

source: Languages differ in how many basic colour terms they have.
jbo: loi bangu cu frica simxu lo ka xo kau da jicmu valsi lo skari ce'u

source: You ought to decide whether or not you want to go.
jbo: .ei do jdice lo du'u xu kau do djica lo nu klama

source: Monday is the first day, Tuesday is the second day, and so on.
jbo: lo pavdei cu pa moi djedi .i lo reldei cu re moi djedi .i li'o

source: What do you believe of "pelmeni"? No, I don't know such word.
jbo: do krici ma zo pelmeni .i na'i go'i .i mi na djuno tu'a lo valsi

source: What do you believe of "pelmeni"? Nothing, I don't know such word.
jbo: do krici ma zo pelmeni .i na'i go'i .i mi na djuno tu'a lo valsi

source: I have an intense "burning" pain in my eyes.
jbo: mi mutce ke jelca pe'a cortu lo kanla

source: It takes literally a minute to make the sauce.
jbo: pe'a nai lo nu zbasu lo sanso cu mentu li pa

source: This is a silly example, i.e. it exemplifies something silly.
jbo: dei bebna mupli .i ta'u mupli lo bebna

source: This is an example of something silly. A silly example, we might say.
jbo: dei mupli lo bebna i ta'u nai bebna mupli

source: He hems and haws. "It's different," he finally says.
jbo: fo'a di'i nai cmoni .i mo'u bacru lu ge'e frica li'u

source: Which table?
jbo: lo ki'a jubme

source: I see, you were joking.
jbo: ki'a nai .i do pu xalbo

source: I understand, you were joking.
jbo: ki'a nai .i do pu xalbo

source: Is this enough?
jbo: xu ti banzu

source: Apples are good for your health, and, in addition, they taste great.
jbo: lo plise cu xamgu lo nu kanro .i ji'a py. kukte

source: I too like apples.
jbo: mi ji'a nelci lo plise

source: A hungry bear will eat even insects.
jbo: lo xagji cribe cu citka lo cinki ku ji'a sai

source: I'm leaving now, but I'll be back in a while.
jbo: mi ca cliva .i ku'i mi ba za xruti

source: I was just saying the very same thing to John.
jbo: mi pu zi co'a cusku di'u mi'u la .djan.

source: I took a book from John and gave another one to Jane.
jbo: mi pu lebna lo cukta la .djan. gije dunda cy. mi'u nai la .djein.

source: I read only the first translation.
jbo: mi pu tcidu lo pamoi po'o xe fanva

source: I try to destroy an object using just my mind.
jbo: mi troci lo ka daspo lo dacti se pi'o lo pe mi menli ku po'o

source: The only thing is, unicorns don't exist.
jbo: po'o lo pavyseljirna na zasti

source: We know that we are closer to monkeys than to rodents. Similarly cats and dogs are closer to one another than to cows or pigs.
jbo: ka'u mi zmajbi lo smani lo ratcu .i si'a lo mlatu jo'u lo gerku cu zmajbi vo'a lo bakni jo'u lo xarju

source: Thank you, friend. You are fair and just.
jbo: ki'e pendo do pairnu'i io re'e

source: There is no god.
jbo: no cevni cu zasti re'enai

source: I'm just puttering here by myself, fixing my computer.
jbo: ni'o .ui ro'a cu'i mi cikre lo pe mi skami

source: I finished building my Gundam model. I feel so lonely.
jbo: ni'o .ui nai ro'a nai mi mo'u zbasu lo pe mi selkei no'u la .gandam.

source: Stupid brain! Why is saying "galxe" so very difficult with a sore throat?
jbo: .i .oi ro'e mu'i ma pau nai lo nu tavla cusku zo galxe cu mutce nandu fi lo nu galxe bilma

source: I did it, through much hard work, though it took but little thought.
jbo: .a'i ro'e cu'i mi snada

source: I am so lonely I think I'm going to cry.
jbo: oi cai ro'i mi mutce caucni

source: I don't care that I don't have an opinion.
jbo: .i mi na jinvi ro'i nai

source: Yum, this food is delicious!
jbo: .oi nai ro'o lo cidja cu kukte

source: Gulp! The food is delicious, but I'm afraid of how expensive it's going to be.
jbo: .ii ro'o cu'i lo cidja cu mutce kukte .i ku'i lo nu ri kargu cu terpa mi

source: You're faster than this. Don't just think you are, know you are.
jbo: ro'o nai dai do ka'e sutra zenba .i ko lo du'u go'i cu jinvi po'o na gije ba'e djuno

source: Damn, she's HOT!
jbo: melbi ro'u

source: I love you, there's just no spark.
jbo: .iu ro'o cu'i

source: I love you like a brother.
jbo: .iu ro'o nai

source: I'm happy now that you've arrived.
jbo: .ui bu'o do tolcliva

source: I see the owner of what I believe to be a blue house.
jbo: mi viska lo fu'e .ia blanu zdani fu'o ponse

source: There is only love and happiness in Scatland. Hatred and resentment? Well that's unheard of. It's unheard of.
jbo: .i fu'e po'o lo za'i prami je lo za'i gleki fu'o cu se cinmo lo se gugde be la skatygug .i lo za'i xebni je lo za'i .i'o zei nai zei cinmo zo'u to'e slabu .i ba'e to'e slabu

source: It's not here.
jbo: be'u

source: This is not enough.
jbo: be'u

source: Heh heh, not enough.
jbo: .u'ibe'u

source: Giddy from having nothing left to lose.
jbo: .u'ibe'u

source: Ahh, I like Lojbanic conversation.
jbo: be'ucu'i mi nelci lo lojbo casnu

source: Drink most, which will definitely sate you, of the coffee.
jbo: ko pinxe so'a be'u nai cai dai ckafi

source: Uhhh, Shoulsen quickly exceeded. You win. Yay you!
jbo: .y. la .clsn. cu sutra zmadu .i do jinga .ui dai

source: Ugh, my internet hates me.
jbo: .oi lo pe mi kibro cu xebni .iu nai dai mi

source: Does using Emacs (which is probably easy for you) cause you to have weak fingers?
jbo: .i xu lo nu pilno la .emaks. fu'i dai cu rinka lo nu ruble degji fi do

source: I despite a startling lack of evidence, I believe I may be able to repair my computer with much difficulty.
jbo: mi krici lo du'u mi kakne lo nu cikre lo pe mi skami kei vau fu'inai

source: Are you -still- not understanding what we're saying, 'sir'? =P
jbo: ni'o xu do za'o na'e jimpe fi lo se cusku be mi'ai vau ga'i .ionai .u'i

source: I'm talking to you, my peers.
jbo: .i mi ro do ga'icu'i tavla

source: Get your meat right into my office, you maggot.
jbo: .i lo rectu be ko ku se canlu lo briju vau ga'i nai

source: Alice (who must certainly be you)'s e-mail got read.
jbo: lo puza selmri be Alis noi ju'o do pu tcidu ke'a

source: Oh geez, I'm not sure, but I think I ate too much.
jbo: .ii ju'o cu'i mi pu zi dukse citka

source: Eimi, you assume it's possible when you find the truth, which is impossible.
jbo: doi la Eimis do sruma lo du'u cumki lenu facki roda poi jetnu ju'onai

source: HEY! Everybody step in line! Follow me!
jbo: le'o ro ko tinbe fi mi

source: Hey, I was trying to familiarly greet you.
jbo: le'ocu'i mi pu troci lo nu slabu rinsa do

source: No worries, you aren't ready to talk about the company, which is useful.
jbo: .i le'ocu'i do na bredi lo nu casnu lo kagni kei poi plixau

source: That's the response to my question!
jbo: lo go'i na danfu lo mi preti vau le'o nai

source: Corn... ah... is the plant containing edible portions.
jbo: zumri ri'e fa lo te stagi be fi lo spati

source: Okay, yes, ehm... it's not a well-known rule, though, you see.
jbo: .o'o nai ri'e nai na slabu javni

source: We, by ourselves, are able to, without a typical crab.
jbo: i mi'o se'a kakne secau lo'e xasyjukni

source: However, the coffee (mildly delicious) machine is always permitted for use. Yay, but ugh for caffeine!
jbo: ku'i lo ckafi to milxe kukte toi minji cu ze'e selplicru .ui .oi se'a nai

source: Alice is talking... eff me...
jbo: .i la Alis ba'e ku cusku vau .oi se'i

source: Hey, could you tell a story about it tomorrow? I'm very interested, and I hope you can.
jbo: .i .e'o do te lisri tu'a ko'a ca lo bavlamdei .a'u sai .ui .a'o se'i nai ro'i

source: Read it. As I remember, you protested quite virtuously the fact that English was the language of the Lojban material.
jbo: ko tcidu .i ba'anai do pante vu'e le za'i lo banrglico cu bangu lo jboskepre

source: Not so. Be a follower of Barack Obama.
jbo: na go'i .i ko se gunma la Barak Obamas .i'i vu'enai

source: Seriously, I postulate that I am, right after my ex-girlfriend leaves my house, going to talk to myself in Lojban.
jbo: zo'o cu'i ru'a mi ca lo nu lo ba'o pampe'o cu cliva lo zdani be mi cu tavla vo'a fo la lojban

source: I love my city.
jbo: mi nelci lo pe mi tcadu

source: No. I don't find that very funny.
jbo: zo'o nai na xajmi mi

source: Holy Fucking Shit! My old ex is a thief!
jbo: .oi cai lo pe mi puzu se prami cu jai tcica fi lo nu jbera lo jdini .i je na xruti gasnu

source: That's so awful! You poor thing! What are you ill with?
jbo: .uu cai do bilma fi ma

source: I'm not asleep, meh.
jbo: .i mi na sipna .ui cu'i

source: I'm not certain if Lojban is a rational language, but I am very sure that Lojbanists are habitually not rational people.
jbo: ju'o cu'i la lojban cu racli bangu i ku'i ju'o sai lo jbopre ta'e na racli prenu

source: Ehhh, I hope I'm not interrupting anything ...
jbo: ii ro'a fi'i pei

source: Do you feel competent about us presenting our argument in English?
jbo: e'e pei mi'o darlu bau lo glico

source: Such as?
jbo: mu'a pei

source: Do you agree that 2 in a set with 2 is a set with one member?
jbo: .ie pei li re ce li re cu se pamei

source: Heh, Camgusmis said "Lobjan".
jbo: i la camgusmis cu cusku zo lobjan u'i ru'e

source: I am mildly annoyed about just spending a while controlling my mother's computer with VNC, then with ssh.
jbo: .oi ru'e mi pu zi ze'a jitro lo skami pe lo pe mi mamta sepi'o la'o gy VNC gy ce'o la'o gy ssh gy

source: Agh. I waited for a long time for the receipt of a present from my mother. However, it's very problematic.
jbo: .oi sai mi pu ze'u denpa lo nu mi te benji lo se dunda lo pe mi mamta .i ku'i mutce nabmi
